'''
台灣縣市經緯度資料
'''
# 台灣縣市經緯度資料 (請自行補充完整資料)
cities_data = {
    "臺北市": [25.04776, 121.5170],
    "新北市": [25.0120, 121.4624],
    "桃園市": [24.9932, 121.3005],
    "臺中市": [24.1465, 120.6840],
    "臺南市": [23.0011, 120.2037],
    "高雄市": [22.6203, 120.3100],
    "基隆市": [25.1330, 121.7418],
    "新竹市": [24.8038, 120.9690],
    "嘉義市": [23.4824, 120.4333],
    "新竹縣": [24.8038, 121.0000],  # 估計經緯度
    "苗栗縣": [24.5682, 120.8208],
    "彰化縣": [24.0694, 120.5400],
    "南投縣": [23.9000, 120.8000],  # 估計經緯度
    "雲林縣": [23.7000, 120.4500],  # 估計經緯度
    "嘉義縣": [23.5000, 120.3500],  # 估計經緯度
    "屏東縣": [22.6700, 120.5000],  # 估計經緯度
    "宜蘭縣": [24.7500, 121.7500],  # 估計經緯度
    "花蓮縣": [23.9800, 121.5800],  # 估計經緯度
    "臺東縣": [22.7500, 121.1000],  # 估計經緯度
    "澎湖縣": [23.5700, 119.6000],  # 估計經緯度
    "金門縣": [24.4500, 118.3500],  # 估計經緯度
    "連江縣": [26.1500, 119.9500]   # 估計經緯度
    }

def get_cities():
    '''
    取得城市清單
    '''
    return cities_data

def get_location_by_city(city_name):
    '''
    依城市名取得座標
    '''
    return cities_data.get(city_name, None)

# 台灣各主要城市名稱
city_names = [
    '臺北市', '新北市', '桃園市', '臺中市', '臺南市', '高雄市',
    '基隆市', '新竹市', '嘉義市', '新竹縣', '苗栗縣', '彰化縣',
    '南投縣', '雲林縣', '嘉義縣', '屏東縣', '宜蘭縣', '花蓮縣',
    '臺東縣', '澎湖縣', '金門縣', '連江縣'
]

def get_city_names():
    '''
    取得城市清單
    '''
    return city_names

city_files = {
    '臺北市': 'a_lvr_land_a.csv',
    '新北市': 'f_lvr_land_a.csv',
    '桃園市': 'h_lvr_land_a.csv',
    '臺中市': 'b_lvr_land_a.csv',
    '臺南市': 'd_lvr_land_a.csv',
    '高雄市': 'e_lvr_land_a.csv',
    '基隆市': 'c_lvr_land_a.csv',
    '宜蘭縣': 'g_lvr_land_a.csv',
    '嘉義市': 'i_lvr_land_a.csv',
    '新竹縣': 'j_lvr_land_a.csv',
    '苗栗縣': 'k_lvr_land_a.csv',
    '南投縣': 'm_lvr_land_a.csv',
    '彰化縣': 'n_lvr_land_a.csv',
    '新竹市': 'o_lvr_land_a.csv',
    '雲林縣': 'p_lvr_land_a.csv',
    '嘉義縣': 'q_lvr_land_a.csv',
    '屏東縣': 't_lvr_land_a.csv',
    '花蓮縣': 'u_lvr_land_a.csv',
    '台東縣': 'v_lvr_land_a.csv',
    '金門縣': 'w_lvr_land_a.csv',
    '澎湖縣': 'x_lvr_land_a.csv',
}

def get_city_files():
    '''
    取得城市清單
    '''
    return city_files
